# name = input("enter your name: ")
# print("hello,", name, '!')

# x = int(input('enter a: '))
# y = int(input('enter b: '))
# print(x+y)

# Написать вывод и решение выражения:

#y = 2*(x+3)
x = int(input('enter a: '))
print('2 * (', x, ' + 3) = ', 2 * x + 3, sep="")  # sep (separator) - Разделитель

# Задачка на if подъехала


